Tekla.Structures.Drawing.PlacingAttributes
The PlacingAttributes class contains the basic attributes for determining an object's placing.
The following example enumerates through all marks in all views and changes
their PlacingAttributes and InsertionPoints.
You may try commenting out either Modify part to see how it affects the end result.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
MarkBase MyMarkBase;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
DrawingObjectEnumerator allObjects = (views.Current as ViewBase).GetAllObjects();
while(allObjects.MoveNext())
{
if(allObjects.Current is MarkBase)
{
MyMarkBase = allObjects.Current as MarkBase;
// Using PlacingAttributes.IsFixed = true will force the mark to go to the specified point.
MyMarkBase.Attributes.PlacingAttributes.IsFixed = true;
MyMarkBase.InsertionPoint = new Point(100, 100);
MyMarkBase.Modify();
// Using PlacingAttributes.IsFixed = false will try to place the mark to the specified point,
// however, if there's already an object there, it will find a new place around that area.
// When finding a place around the area, the rest of the PlacingAttributes take effect.
MyMarkBase.Attributes.PlacingAttributes.IsFixed = false;
// Minimum amount it needs to move to find new place
MyMarkBase.Attributes.PlacingAttributes.PlacingDistance.MinimalDistance = 1.0;
// Maximum amount it will try to search in
MyMarkBase.Attributes.PlacingAttributes.PlacingDistance.SearchMargin = 10.0;
// The directions to look for possible places
MyMarkBase.Attributes.PlacingAttributes.PlacingQuarter = new PlacingQuarterAttributes(TopLeft: true, TopRight: true, BottomLeft: true, BottomRight: true);
MyMarkBase.InsertionPoint = new Point(100, 100);
MyMarkBase.Modify();
}
}
}
}
}
}